import numpy as np

# Входные данные из таблицы.
# Формат: [Тактовая частота, Утилизация, Температура]

X_data = np.array([
    [1500, 50, 38],
    [1500, 55, 45],
    [1500, 60, 52],
    [1500, 65, 60],
    [1500, 70, 67],
    [2600, 35, 30],
    [2600, 40, 31],
    [2600, 45, 32],
    [2600, 50, 33],
    [2600, 60, 28]  
])

# Целевая переменная: UDP Throughput, Мбит/с.
Y_data = np.array([600, 650, 700, 750, 900, 750, 800, 850, 900, 600])

# Заданные значения UDP Throughput из таблицы 2.2
throughputs = [50, 100, 150, 200, 250, 300, 350, 400, 450, 500]

